In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(labels,my_data)

10    a
20    b
30    c
dtype: object

In [10]:
#can also pass it built in functions,probably will never use bit it shows how flexible it is
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,3,50],['USA','Germany','Italy','Japan'])

In [14]:
ser1['USA']

1

In [16]:
#adds where applicable but adds NaN where it cant find a match
ser1+ser2

Germany     4.0
Italy       NaN
Japan      54.0
USA         2.0
USSR        NaN
dtype: float64

# DATAFRAMES Part 1

In [17]:
from numpy.random import randn

In [18]:
#so we get the same results
np.random.seed(101)

In [20]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

brack notation is better sometimes since a column name might overwrite one of the built in functions for a datafram or series and python wont know which one to reference

In [25]:
#create new column 
df['new'] = df['Y']+df['X']

In [28]:
#can drop a column, but need to set axis=1 since its defaulted to 0 which is index
#not inplace unless we specify it to drop in place
#this is a safety feature so we dont drop by accident
df.drop('new',axis=1)
df.drop('new',axis=1,inplace=True)

In [30]:
#drop index
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [31]:
df.shape

(5, 4)

In [32]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [45]:
#2 ways to select rows in dataframe, loc and iloc,loc is value iloc is number
df.loc['A']

#can also select subsets
df.loc['A':'D',['X','Z']]
df.loc['C':'C','W':'Z']

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [41]:
df.iloc[1:3]
df.iloc[1:3,2:4]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

# DataFrames part 2: Conditionals

In [48]:
#conditional selection, this will return a dataframe of boolean values
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [49]:
#can then pass the boolean to create a datafram that has NaN where that is not true
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
#however what is more common is to use a conditional with a column
#this will return a subset of the dataframe where this is true
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
#returns a datframe and we can call commands off this e to get results
df[df['Z']> 0]['W']

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

can create multiple conditionals but you can not use AND, OR, NOT operators,
because we are passing an entire series of boolean the AND/OR operators get confused, instead we must pass it the & (for AND) or the | (for OR)

In [75]:
# OR operator , each conditional must be inside parenthesis
df[(df['W']>0) | (df['X']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
# AND operator, each conditional must be inside parenthesis
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [78]:
#can reset out index back to numerical, however it is defaulted to inplace=False
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [80]:
#can also set a new index, this is a very easy way to create a list w/o typing all the '' & commas
newindex = 'CA NY WY OR CO'.split()

In [81]:
df['States'] = newindex

In [83]:
#set_index allows us to pick a new index for the dataframe, again inplace=False by default
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

#  DataFrames part 3: index levels

In [89]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
#this method can take in a tuples and turn it into a multiindex object 
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [87]:
#we can then pass it through to our dataframe object
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [88]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [91]:
#can also index through it
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [94]:
#we can set the index of each level, by default they are set to None
df.index.names = ['Groups','Nums']

In [95]:
df

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [100]:
#can even index further
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [103]:
#returns a cross section, that has the ability to skip or go inside of a multilevel index
df.xs('G1')

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [105]:
#example of complicated grab made easy with xs by allowing us to go inside multilevel index
df.xs(1,level='Nums')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [106]:
d = {'A':[1,2,np.nan],'B': [5,np.nan,np.nan],'C': [1,2,3]}

In [107]:
df = pd.DataFrame(d)

In [108]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [110]:
#drops all null values, but again inplace=False and axis=0 by default so will drop rows by default
df.dropna()

     A    B  C
0  1.0  5.0  1

In [112]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [113]:
#can also set a threshold for a # of NaN to drop a column
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [116]:
#can also fill in NaN values instead of dropping them
df.fillna(value='Fill Value')
#usually more common to fill in with the mean or median 
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

dealing with NAN values depends on the dataset you are working with and there are various different methods for various different cases

# Groupby

allows you to aggregate certain id's or values with a aggregate function such as sum,average,std and so on

In [117]:
data = {'Company':['GOOG','GOOG','MSFT', 'MSFT','FB','FB'],
       'Person': ['Sam','Charlies','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [118]:
df=pd.DataFrame(data)

In [119]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG  Charlies    120
2    MSFT       Amy    340
3    MSFT   Vanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [121]:
#can group by a column and its values
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [124]:
#we can also index off of this since it returns a DataFrame
df.groupby('Company').mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [125]:
#can also use groupby with describe method
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [126]:
#if we dont like the companies being the rows we can transpose it
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining, and Concatenating

In [127]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                    'B': ['B0','B1','B2','B3'],
                    'C': ['C0','C1','C2','C3'],
                    'D': ['D0','D1','D2','D3']},
                  index=[0,1,2,3])

In [128]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                    'B': ['B4','B5','B6','B7'],
                    'C': ['C4','C5','C6','C7'],
                    'D': ['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [129]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                    'B': ['B8','B9','B10','B11'],
                    'C': ['C8','C9','C10','C11'],
                    'D': ['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [130]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [131]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [132]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [135]:
#add together two dataframes, defaults to axis=0
#we want the axis were not concatenating on to be the same(i.e columns for axis=0)
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [136]:
#can also set axis=1, but notice what happends when they dont have values for all indices
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [151]:

left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [148]:
#merging works similiar to SQL, we can set the key to merge and how it mergers
pd.merge(left,right, how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [154]:
#can also merge on multiple columns
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                     'key2':['K0','K1','K0','K1'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                      'key2':['K0','K0','K0','K0'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})

In [157]:
#merge defaults to inner
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [158]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [159]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [167]:

left = pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])

right = pd.DataFrame({'C':['C0','C1','C2'],
                     'D':['D0','D1','D2']},
                     index= ['K0','K2','K3'])

In [170]:
#joining is for combining the columns of two potentially differntly index df into a single df
#defaults to an inner join, the main difference is it joins on the index instead of a column
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [169]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# Operations

In [171]:
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [444,555,666,444],
                  'col3': ['abc','def','ghi','xyz']})

3 main methods for finding unique values in a dataframe

In [173]:
#unique : returns all unique values 
df['col2'].unique()

array([444, 555, 666])

In [174]:
#nunique : returns number of unique values
df['col2'].nunique()

3

In [176]:
#counts how many times each value appears
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

The Apply method

we can apply our own functions with lambda functions, created functions, or built in functions

In [179]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [182]:
def time2(x):
    return x*2

In [184]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [185]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [186]:
#can also sort values
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Datanput and Output